tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/mapFieldsTesting/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
11961
(
(0.975399 0.100222 -6.29161e-22)
(0.532477 0.134535 1.93361e-21)
(0.496497 -0.00741666 1.50378e-20)
(0.960816 0.18012 -6.07195e-22)
(1.06694 -0.121539 -7.1712e-22)
(0.620989 0.0378801 -6.45611e-21)
(1.12246 0.0143231 -1.59474e-21)
(1.00284 -0.00524946 -4.23615e-22)
...
)
;

boundaryField
{
    airfoil
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
