tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/mapFieldsTesting/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
2.09537e-23
2.12181e-25
6.13173e-25
1.17494e-26
5.47538e-29
5.85808e-20
3.22417e-24
4.00044e-13
...
)
;

boundaryField
{
    airfoil
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 6.1605e-05;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
