tutorials/incompressible/pimpleRemeshFoam/cavitation_simple/mapFieldsTesting/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
11961
(
6.78386e+11
2.7463e+17
5.55281e+09
5.90468e+14
1.94825e+19
8.55219e+06
1.36334e+12
3.46158e+06
...
)
;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 0.600601;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 0.600601;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
